Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz2051ca90208.h
#define PIN_PG02A_EIC_EXTINT2                      _UINT32_(194)
#define MUX_PG02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PG02A_EIC_EXTINT2                   ((PIN_PG02A_EIC_EXTINT2 << 16) | MUX_PG02A_EIC_EXTINT2)
#define PORT_PG02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PG02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PG02 External Interrupt Line */

#define PIN_PA03A_EIC_EXTINT3                      _UINT32_(3) 
#define MUX_PA03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PA03A_EIC_EXTINT3                   ((PIN_PA03A_EIC_EXTINT3 << 16) | MUX_PA03A_EIC_EXTINT3)
#define PORT_PA03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PA03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PA03 External Interrupt Line */

#define PIN_PA19A_EIC_EXTINT3                      _UINT32_(19)
#define MUX_PA19A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PA19A_EIC_EXTINT3                   ((PIN_PA19A_EIC_EXTINT3 << 16) | MUX_PA19A_EIC_EXTINT3)
#define PORT_PA19A_EIC_EXTINT3                     (_UINT32_(1) << 19)
#define PIN_PA19A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PA19 External Interrupt Line */

#define PIN_PB03A_EIC_EXTINT3                      _UINT32_(35)
#define MUX_PB03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PB03A_EIC_EXTINT3                   ((PIN_PB03A_EIC_EXTINT3 << 16) | MUX_PB03A_EIC_EXTINT3)
#define PORT_PB03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PB03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PB03 External Interrupt Line */

#define PIN_PB19A_EIC_EXTINT3                      _UINT32_(51)
#define MUX_PB19A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PB19A_EIC_EXTINT3                   ((PIN_PB19A_EIC_EXTINT3 << 16) | MUX_PB19A_EIC_EXTINT3)
#define PORT_PB19A_EIC_EXTINT3                     (_UINT32_(1) << 19)
#define PIN_PB19A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PB19 External Interrupt Line */

#define PIN_PC03A_EIC_EXTINT3                      _UINT32_(67)
#define MUX_PC03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PC03A_EIC_EXTINT3                   ((PIN_PC03A_EIC_EXTINT3 << 16) | MUX_PC03A_EIC_EXTINT3)
#define PORT_PC03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PC03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PC03 External Interrupt Line */

#define PIN_PC19A_EIC_EXTINT3                      _UINT32_(83)
#define MUX_PC19A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PC19A_EIC_EXTINT3                   ((PIN_PC19A_EIC_EXTINT3 << 16) | MUX_PC19A_EIC_EXTINT3)
#define PORT_PC19A_EIC_EXTINT3                     (_UINT32_(1) << 19)
#define PIN_PC19A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PC19 External Interrupt Line */

#define PIN_PD03A_EIC_EXTINT3                      _UINT32_(99)
#define MUX_PD03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PD03A_EIC_EXTINT3                   ((PIN_PD03A_EIC_EXTINT3 << 16) | MUX_PD03A_EIC_EXTINT3)
#define PORT_PD03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PD03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PD03 External Interrupt Line */

#define PIN_PD18A_EIC_EXTINT3                      _UINT32_(114)
#define MUX_PD18A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PD18A_EIC_EXTINT3                   ((PIN_PD18A_EIC_EXTINT3 << 16) | MUX_PD18A_EIC_EXTINT3)
#define PORT_PD18A_EIC_EXTINT3                     (_UINT32_(1) << 18)
#define PIN_PD18A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PD18 External Interrupt Line */

#define PIN_PE03A_EIC_EXTINT3                      _UINT32_(131)
#define MUX_PE03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PE03A_EIC_EXTINT3                   ((PIN_PE03A_EIC_EXTINT3 << 16) | MUX_PE03A_EIC_EXTINT3)
#define PORT_PE03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PE03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PE03 External Interrupt Line */

#define PIN_PF03A_EIC_EXTINT3                      _UINT32_(163)
#define MUX_PF03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PF03A_EIC_EXTINT3                   ((PIN_PF03A_EIC_EXTINT3 << 16) | MUX_PF03A_EIC_EXTINT3)
#define PORT_PF03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PF03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PF03 External Interrupt Line */

#define PIN_PG03A_EIC_EXTINT3                      _UINT32_(195)
#define MUX_PG03A_EIC_EXTINT3                      _UINT32_(0) 
#define PINMUX_PG03A_EIC_EXTINT3                   ((PIN_PG03A_EIC_EXTINT3 << 16) | MUX_PG03A_EIC_EXTINT3)
#define PORT_PG03A_EIC_EXTINT3                     (_UINT32_(1) << 3)
#define PIN_PG03A_EIC_EXTINT_NUM                   _UINT32_(3)  /* EIC signal: PIN_PG03 External Interrupt Line */

#define PIN_PA04A_EIC_EXTINT4                      _UINT32_(4) 
#define MUX_PA04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PA04A_EIC_EXTINT4                   ((PIN_PA04A_EIC_EXTINT4 << 16) | MUX_PA04A_EIC_EXTINT4)
#define PORT_PA04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PA04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PA04 External Interrupt Line */

#define PIN_PA05A_EIC_EXTINT4                      _UINT32_(5) 
#define MUX_PA05A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PA05A_EIC_EXTINT4                   ((PIN_PA05A_EIC_EXTINT4 << 16) | MUX_PA05A_EIC_EXTINT4)
#define PORT_PA05A_EIC_EXTINT4                     (_UINT32_(1) << 5)
#define PIN_PA05A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PA05 External Interrupt Line */

#define PIN_PA20A_EIC_EXTINT4                      _UINT32_(20)
#define MUX_PA20A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PA20A_EIC_EXTINT4                   ((PIN_PA20A_EIC_EXTINT4 << 16) | MUX_PA20A_EIC_EXTINT4)
#define PORT_PA20A_EIC_EXTINT4                     (_UINT32_(1) << 20)
#define PIN_PA20A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PA20 External Interrupt Line */

#define PIN_PB04A_EIC_EXTINT4                      _UINT32_(36)
#define MUX_PB04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PB04A_EIC_EXTINT4                   ((PIN_PB04A_EIC_EXTINT4 << 16) | MUX_PB04A_EIC_EXTINT4)
#define PORT_PB04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PB04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PB04 External Interrupt Line */

