Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz2051ca90208.h
#define PIN_PB27A_EIC_EXTINT11                     _UINT32_(59)
#define MUX_PB27A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PB27A_EIC_EXTINT11                  ((PIN_PB27A_EIC_EXTINT11 << 16) | MUX_PB27A_EIC_EXTINT11)
#define PORT_PB27A_EIC_EXTINT11                    (_UINT32_(1) << 27)
#define PIN_PB27A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PB27 External Interrupt Line */

#define PIN_PC11A_EIC_EXTINT11                     _UINT32_(75)
#define MUX_PC11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PC11A_EIC_EXTINT11                  ((PIN_PC11A_EIC_EXTINT11 << 16) | MUX_PC11A_EIC_EXTINT11)
#define PORT_PC11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PC11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PC11 External Interrupt Line */

#define PIN_PC27A_EIC_EXTINT11                     _UINT32_(91)
#define MUX_PC27A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PC27A_EIC_EXTINT11                  ((PIN_PC27A_EIC_EXTINT11 << 16) | MUX_PC27A_EIC_EXTINT11)
#define PORT_PC27A_EIC_EXTINT11                    (_UINT32_(1) << 27)
#define PIN_PC27A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PC27 External Interrupt Line */

#define PIN_PD11A_EIC_EXTINT11                     _UINT32_(107)
#define MUX_PD11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PD11A_EIC_EXTINT11                  ((PIN_PD11A_EIC_EXTINT11 << 16) | MUX_PD11A_EIC_EXTINT11)
#define PORT_PD11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PD11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PD11 External Interrupt Line */

#define PIN_PD27A_EIC_EXTINT11                     _UINT32_(123)
#define MUX_PD27A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PD27A_EIC_EXTINT11                  ((PIN_PD27A_EIC_EXTINT11 << 16) | MUX_PD27A_EIC_EXTINT11)
#define PORT_PD27A_EIC_EXTINT11                    (_UINT32_(1) << 27)
#define PIN_PD27A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PD27 External Interrupt Line */

#define PIN_PE11A_EIC_EXTINT11                     _UINT32_(139)
#define MUX_PE11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PE11A_EIC_EXTINT11                  ((PIN_PE11A_EIC_EXTINT11 << 16) | MUX_PE11A_EIC_EXTINT11)
#define PORT_PE11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PE11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PE11 External Interrupt Line */

#define PIN_PG11A_EIC_EXTINT11                     _UINT32_(203)
#define MUX_PG11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PG11A_EIC_EXTINT11                  ((PIN_PG11A_EIC_EXTINT11 << 16) | MUX_PG11A_EIC_EXTINT11)
#define PORT_PG11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PG11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PG11 External Interrupt Line */

#define PIN_PA12A_EIC_EXTINT12                     _UINT32_(12)
#define MUX_PA12A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PA12A_EIC_EXTINT12                  ((PIN_PA12A_EIC_EXTINT12 << 16) | MUX_PA12A_EIC_EXTINT12)
#define PORT_PA12A_EIC_EXTINT12                    (_UINT32_(1) << 12)
#define PIN_PA12A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PA12 External Interrupt Line */

#define PIN_PA28A_EIC_EXTINT12                     _UINT32_(28)
#define MUX_PA28A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PA28A_EIC_EXTINT12                  ((PIN_PA28A_EIC_EXTINT12 << 16) | MUX_PA28A_EIC_EXTINT12)
#define PORT_PA28A_EIC_EXTINT12                    (_UINT32_(1) << 28)
#define PIN_PA28A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PA28 External Interrupt Line */

#define PIN_PB12A_EIC_EXTINT12                     _UINT32_(44)
#define MUX_PB12A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PB12A_EIC_EXTINT12                  ((PIN_PB12A_EIC_EXTINT12 << 16) | MUX_PB12A_EIC_EXTINT12)
#define PORT_PB12A_EIC_EXTINT12                    (_UINT32_(1) << 12)
#define PIN_PB12A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PB12 External Interrupt Line */

#define PIN_PB28A_EIC_EXTINT12                     _UINT32_(60)
#define MUX_PB28A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PB28A_EIC_EXTINT12                  ((PIN_PB28A_EIC_EXTINT12 << 16) | MUX_PB28A_EIC_EXTINT12)
#define PORT_PB28A_EIC_EXTINT12                    (_UINT32_(1) << 28)
#define PIN_PB28A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PB28 External Interrupt Line */

#define PIN_PC12A_EIC_EXTINT12                     _UINT32_(76)
#define MUX_PC12A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PC12A_EIC_EXTINT12                  ((PIN_PC12A_EIC_EXTINT12 << 16) | MUX_PC12A_EIC_EXTINT12)
#define PORT_PC12A_EIC_EXTINT12                    (_UINT32_(1) << 12)
#define PIN_PC12A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PC12 External Interrupt Line */

#define PIN_PC28A_EIC_EXTINT12                     _UINT32_(92)
#define MUX_PC28A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PC28A_EIC_EXTINT12                  ((PIN_PC28A_EIC_EXTINT12 << 16) | MUX_PC28A_EIC_EXTINT12)
#define PORT_PC28A_EIC_EXTINT12                    (_UINT32_(1) << 28)
#define PIN_PC28A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PC28 External Interrupt Line */

#define PIN_PD12A_EIC_EXTINT12                     _UINT32_(108)
#define MUX_PD12A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PD12A_EIC_EXTINT12                  ((PIN_PD12A_EIC_EXTINT12 << 16) | MUX_PD12A_EIC_EXTINT12)
#define PORT_PD12A_EIC_EXTINT12                    (_UINT32_(1) << 12)
#define PIN_PD12A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PD12 External Interrupt Line */

#define PIN_PD28A_EIC_EXTINT12                     _UINT32_(124)
#define MUX_PD28A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PD28A_EIC_EXTINT12                  ((PIN_PD28A_EIC_EXTINT12 << 16) | MUX_PD28A_EIC_EXTINT12)
#define PORT_PD28A_EIC_EXTINT12                    (_UINT32_(1) << 28)
#define PIN_PD28A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PD28 External Interrupt Line */

