Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz2051ca90208.h
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PC25D_SERCOM5_PAD0                     _UINT32_(89)
#define MUX_PC25D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PC25D_SERCOM5_PAD0                  ((PIN_PC25D_SERCOM5_PAD0 << 16) | MUX_PC25D_SERCOM5_PAD0)
#define PORT_PC25D_SERCOM5_PAD0                    (_UINT32_(1) << 25)

#define PIN_PC26D_SERCOM5_PAD1                     _UINT32_(90)
#define MUX_PC26D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PC26D_SERCOM5_PAD1                  ((PIN_PC26D_SERCOM5_PAD1 << 16) | MUX_PC26D_SERCOM5_PAD1)
#define PORT_PC26D_SERCOM5_PAD1                    (_UINT32_(1) << 26)

#define PIN_PC27D_SERCOM5_PAD2                     _UINT32_(91)
#define MUX_PC27D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PC27D_SERCOM5_PAD2                  ((PIN_PC27D_SERCOM5_PAD2 << 16) | MUX_PC27D_SERCOM5_PAD2)
#define PORT_PC27D_SERCOM5_PAD2                    (_UINT32_(1) << 27)

#define PIN_PC28D_SERCOM5_PAD3                     _UINT32_(92)
#define MUX_PC28D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PC28D_SERCOM5_PAD3                  ((PIN_PC28D_SERCOM5_PAD3 << 16) | MUX_PC28D_SERCOM5_PAD3)
#define PORT_PC28D_SERCOM5_PAD3                    (_UINT32_(1) << 28)

/* ========== PORT definition for SERCOM6 peripheral ========== */
#define PIN_PC30D_SERCOM6_PAD0                     _UINT32_(94)
#define MUX_PC30D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PC30D_SERCOM6_PAD0                  ((PIN_PC30D_SERCOM6_PAD0 << 16) | MUX_PC30D_SERCOM6_PAD0)
#define PORT_PC30D_SERCOM6_PAD0                    (_UINT32_(1) << 30)

#define PIN_PC31D_SERCOM6_PAD1                     _UINT32_(95)
#define MUX_PC31D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PC31D_SERCOM6_PAD1                  ((PIN_PC31D_SERCOM6_PAD1 << 16) | MUX_PC31D_SERCOM6_PAD1)
#define PORT_PC31D_SERCOM6_PAD1                    (_UINT32_(1) << 31)

#define PIN_PG00D_SERCOM6_PAD2                     _UINT32_(192)
#define MUX_PG00D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PG00D_SERCOM6_PAD2                  ((PIN_PG00D_SERCOM6_PAD2 << 16) | MUX_PG00D_SERCOM6_PAD2)
#define PORT_PG00D_SERCOM6_PAD2                    (_UINT32_(1) << 0)

#define PIN_PG01D_SERCOM6_PAD3                     _UINT32_(193)
#define MUX_PG01D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PG01D_SERCOM6_PAD3                  ((PIN_PG01D_SERCOM6_PAD3 << 16) | MUX_PG01D_SERCOM6_PAD3)
#define PORT_PG01D_SERCOM6_PAD3                    (_UINT32_(1) << 1)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PD14D_SERCOM7_PAD0                     _UINT32_(110)
#define MUX_PD14D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PD14D_SERCOM7_PAD0                  ((PIN_PD14D_SERCOM7_PAD0 << 16) | MUX_PD14D_SERCOM7_PAD0)
#define PORT_PD14D_SERCOM7_PAD0                    (_UINT32_(1) << 14)

#define PIN_PD15D_SERCOM7_PAD1                     _UINT32_(111)
#define MUX_PD15D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PD15D_SERCOM7_PAD1                  ((PIN_PD15D_SERCOM7_PAD1 << 16) | MUX_PD15D_SERCOM7_PAD1)
#define PORT_PD15D_SERCOM7_PAD1                    (_UINT32_(1) << 15)

#define PIN_PD16D_SERCOM7_PAD2                     _UINT32_(112)
#define MUX_PD16D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PD16D_SERCOM7_PAD2                  ((PIN_PD16D_SERCOM7_PAD2 << 16) | MUX_PD16D_SERCOM7_PAD2)
#define PORT_PD16D_SERCOM7_PAD2                    (_UINT32_(1) << 16)

#define PIN_PD17D_SERCOM7_PAD3                     _UINT32_(113)
#define MUX_PD17D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PD17D_SERCOM7_PAD3                  ((PIN_PD17D_SERCOM7_PAD3 << 16) | MUX_PD17D_SERCOM7_PAD3)
#define PORT_PD17D_SERCOM7_PAD3                    (_UINT32_(1) << 17)

/* ========== PORT definition for SERCOM8 peripheral ========== */
#define PIN_PD24D_SERCOM8_PAD0                     _UINT32_(120)
#define MUX_PD24D_SERCOM8_PAD0                     _UINT32_(3) 
#define PINMUX_PD24D_SERCOM8_PAD0                  ((PIN_PD24D_SERCOM8_PAD0 << 16) | MUX_PD24D_SERCOM8_PAD0)
#define PORT_PD24D_SERCOM8_PAD0                    (_UINT32_(1) << 24)

#define PIN_PD25D_SERCOM8_PAD1                     _UINT32_(121)
#define MUX_PD25D_SERCOM8_PAD1                     _UINT32_(3) 
#define PINMUX_PD25D_SERCOM8_PAD1                  ((PIN_PD25D_SERCOM8_PAD1 << 16) | MUX_PD25D_SERCOM8_PAD1)
#define PORT_PD25D_SERCOM8_PAD1                    (_UINT32_(1) << 25)

#define PIN_PD26D_SERCOM8_PAD2                     _UINT32_(122)
#define MUX_PD26D_SERCOM8_PAD2                     _UINT32_(3) 
#define PINMUX_PD26D_SERCOM8_PAD2                  ((PIN_PD26D_SERCOM8_PAD2 << 16) | MUX_PD26D_SERCOM8_PAD2)
#define PORT_PD26D_SERCOM8_PAD2                    (_UINT32_(1) << 26)

#define PIN_PD27D_SERCOM8_PAD3                     _UINT32_(123)
#define MUX_PD27D_SERCOM8_PAD3                     _UINT32_(3) 
#define PINMUX_PD27D_SERCOM8_PAD3                  ((PIN_PD27D_SERCOM8_PAD3 << 16) | MUX_PD27D_SERCOM8_PAD3)
#define PORT_PD27D_SERCOM8_PAD3                    (_UINT32_(1) << 27)

/* ========== PORT definition for SERCOM9 peripheral ========== */
#define PIN_PD28D_SERCOM9_PAD0                     _UINT32_(124)
#define MUX_PD28D_SERCOM9_PAD0                     _UINT32_(3) 
#define PINMUX_PD28D_SERCOM9_PAD0                  ((PIN_PD28D_SERCOM9_PAD0 << 16) | MUX_PD28D_SERCOM9_PAD0)
#define PORT_PD28D_SERCOM9_PAD0                    (_UINT32_(1) << 28)

#define PIN_PD29D_SERCOM9_PAD1                     _UINT32_(125)
#define MUX_PD29D_SERCOM9_PAD1                     _UINT32_(3) 
#define PINMUX_PD29D_SERCOM9_PAD1                  ((PIN_PD29D_SERCOM9_PAD1 << 16) | MUX_PD29D_SERCOM9_PAD1)
#define PORT_PD29D_SERCOM9_PAD1                    (_UINT32_(1) << 29)

#define PIN_PE04D_SERCOM9_PAD2                     _UINT32_(132)
#define MUX_PE04D_SERCOM9_PAD2                     _UINT32_(3) 
#define PINMUX_PE04D_SERCOM9_PAD2                  ((PIN_PE04D_SERCOM9_PAD2 << 16) | MUX_PE04D_SERCOM9_PAD2)
#define PORT_PE04D_SERCOM9_PAD2                    (_UINT32_(1) << 4)

#define PIN_PE05D_SERCOM9_PAD3                     _UINT32_(133)
#define MUX_PE05D_SERCOM9_PAD3                     _UINT32_(3) 
#define PINMUX_PE05D_SERCOM9_PAD3                  ((PIN_PE05D_SERCOM9_PAD3 << 16) | MUX_PE05D_SERCOM9_PAD3)
#define PORT_PE05D_SERCOM9_PAD3                    (_UINT32_(1) << 5)

/* ========== PORT definition for SPI_IXS0 peripheral ========== */
#define PIN_PC00J_SPI_IXS0_FSYNC                   _UINT32_(64)
#define MUX_PC00J_SPI_IXS0_FSYNC                   _UINT32_(9) 
#define PINMUX_PC00J_SPI_IXS0_FSYNC                ((PIN_PC00J_SPI_IXS0_FSYNC << 16) | MUX_PC00J_SPI_IXS0_FSYNC)
#define PORT_PC00J_SPI_IXS0_FSYNC                  (_UINT32_(1) << 0)

#define PIN_PD02J_SPI_IXS0_FSYNC                   _UINT32_(98)
#define MUX_PD02J_SPI_IXS0_FSYNC                   _UINT32_(9) 
#define PINMUX_PD02J_SPI_IXS0_FSYNC                ((PIN_PD02J_SPI_IXS0_FSYNC << 16) | MUX_PD02J_SPI_IXS0_FSYNC)
#define PORT_PD02J_SPI_IXS0_FSYNC                  (_UINT32_(1) << 2)

